#ifndef _LED__H_
#define _LED__H_

#include "NUC029xAN.h"

typedef enum{
	CTRL = 0,	//模式控制，指定亮灭状态
	BLINK	//闪烁模式
}LED_MODE;
typedef enum{
	Off = 0,	//灯亮
	On = 1,	//灯灭
	Radom = 2
}LED_STATUS;

/***************************************************************************
	功能:灯GPIO初始化
	输入:无
	输出:无
	返回:无
	特殊说明:无
*****************************************************************************/
extern void LightInit(void);



/***************************************************************************
	功能:灯状态控制
	输入:
		Mode:模式(=CTRL时根据On的值控制灯状态;=BLINK时闪烁模式,On值无效)
		On:灯亮灭控制
	输出:无
	返回:无
	特殊说明:无
*****************************************************************************/
extern void LightCtrl(uint32_t Led,LED_MODE Mode,LED_STATUS OnOff);




#endif
